In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [7]:
ser.iloc[2]
ser.loc[2]

2.0

In [8]:
ser.iloc[-1]

2.0

In [14]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [21]:
ser2.loc["b"]
ser2.iloc[2]
ser2.iloc[-1]
ser2.iloc[:2]

a    0.0
b    1.0
dtype: float64

In [35]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data["one"]=1

In [37]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [42]:
data.iloc[2]=5

In [43]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [32]:
data[data['four']>5]

          one  two  three  four
Colorado    1    5      6     7
New York    1   13     14    15

In [40]:
data['one']=2

In [44]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [66]:
data[data["three"]==5]["two"] # 자료구조가 시리즈로 나옴
data[data['three'] == 5][['two']] # 자료구조가 데이터프레임으로 나옴

      two
Utah    5

In [65]:
data.loc[data["three"]==5].iloc[:,1:2]

      two
Utah    5

In [68]:
data.loc[data['three']==5,'two']=10 #loc 대괄호에 왼쪽에 행 , 오른쪽에 열에 관해 조건주는것도 가능.

In [69]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5   10      5     5
New York    2   13     14    15

In [70]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [71]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [72]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [79]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [81]:
df1 = pd.DataFrame(np.arange(9.),columns=['b'])
df1

     b
0  0.0
1  1.0
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [93]:
#list('bcd') -> ["b","c","d"]
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [94]:
df2=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=["Utah","Ohio","Texas",'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [95]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [97]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [98]:
df2

   B
0  3
1  4

In [99]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [100]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [101]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [102]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [103]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [104]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [115]:
df2.loc[1,"b"]=np.nan

In [114]:
np.nan # 결측값

nan

In [116]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
df1+df2 # nan에 어떤 값을 더해도 nan

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [119]:
df1.add(df2) #더하기 함수

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [120]:
df1.add(df2, fill_value=0) # fill value = nan 값을 0으로 채움 nan이 0이 되기때문에 계산이 가능

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [121]:
1/df1 # inf = infinity number 무한대

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [122]:
df1.div(2) # df/2 = df1을 2로 나눠라

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [123]:
df1.rdiv(2)# 2/df1 = 2를 df1로 나눠라

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [124]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [125]:
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [127]:
df1.reindex(columns=df2.columns)

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN

In [128]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [129]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [130]:
arr-arr[0] #브로드캐스팅

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [132]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [134]:
ser=frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [135]:
frame-ser # 같은 b,d,e인덱스에 해당하는 데이터 끼리 뺄셈 적용

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [136]:

series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [137]:
frame-series2 # 같은 인덱스끼리 연산되고 어느 한쪽만 데이터가 존재하면 NaN 출력

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [138]:
frame.sub(series2)

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [146]:
np.abs(frame) #절댓값

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [147]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.276469  0.885450  0.238222
Ohio   -0.336213 -0.452028  3.353032
Texas  -0.149767  1.247682  0.806644
Oregon -1.088461  0.052683  1.962552

In [148]:
np.abs(frame) #절댓값

               b         d         e
Utah    0.276469  0.885450  0.238222
Ohio    0.336213  0.452028  3.353032
Texas   0.149767  1.247682  0.806644
Oregon  1.088461  0.052683  1.962552

In [159]:
#열 단위로 최댓값,최소값 구해서 차를 출력
frame['b'].max()

-0.14976715961343148

In [160]:
frame['b'].min()

-1.0884612618148102

In [161]:
frame['b'].max()-frame['b'].min()

0.9386941022013787

In [171]:
def f1(x): # 괄호안에 f1함수에 들어갈 각각의 열 들이 전달
    # print(x.max())
    # print(x.min())
    # print(x.max()-x.min())
    # print("="*50)
    return x.max()-x.min()

In [172]:
frame.apply(f1) # R언어에도 apply 계열의 함수가 있음/ 데이터 프레임에 열 단위로 apply(적용)해라 frmae.apply(무엇을(어떤 함수를))
# apply를 실행하면 열 단위로 작업이 진행되며 결과가 시리즈로 나옴.

b    0.938694
d    1.699710
e    3.114811
dtype: float64

In [177]:
def f1(x):
    return x.max()-x.min()
frame.apply(f1,axis=1) #행 열 단위로 축을 줄 수 있음. default=0(열) 1=(행)기준으로 함수에 들어감

Utah      1.161919
Ohio      3.805061
Texas     1.397449
Oregon    3.051013
dtype: float64

In [180]:
def f2(x):
    return x.max(),x.min()
frame.apply(f2,axis=0) #각 열에 대한 최댓값과 최솟값이 나옴.

          b         d         e
0 -0.149767  1.247682  3.353032
1 -1.088461 -0.452028  0.238222

In [181]:
def f2(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])
frame.apply(f2,axis=0)

            b         d         e
max -0.149767  1.247682  3.353032
min -1.088461 -0.452028  0.238222

In [182]:
frame

               b         d         e
Utah   -0.276469  0.885450  0.238222
Ohio   -0.336213 -0.452028  3.353032
Texas  -0.149767  1.247682  0.806644
Oregon -1.088461  0.052683  1.962552

In [186]:
x=-0.276469
print(f"{x:.2f}")

-0.28

In [193]:
def my_format(x):
    return f"{x:.2f}"
frame.applymap(my_format) #(각각의 데이터 하나하나에 적용하겠다 =applymap 각각의 열 또는 행에적용 = apply)

C:\Users\master\AppData\Local\Temp\ipykernel_16052\1380983260.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d     e
Utah    -0.28   0.89  0.24
Ohio    -0.34  -0.45  3.35
Texas   -0.15   1.25  0.81
Oregon  -1.09   0.05  1.96

In [197]:
def my_format(x):
    return f"{x:.2f}"
frame['b'].applymap(my_format) # 시리즈에서는 applymap을 사용할 수 없다

AttributeError: 'Series' object has no attribute 'applymap'

In [199]:
def my_format(x):
    return f"{x:.2f}"
frame['b'].map(my_format)  #시리즈에 각 요소에 적용시키는것은 map 함수를 사용하면 됨

Utah      -0.28
Ohio      -0.34
Texas     -0.15
Oregon    -1.09
Name: b, dtype: object

In [205]:
def my_format(x):
    return f"{x:.2f}"
frame[['b']].map(my_format) #이런식으로 b열을 데이터 프레임식으로 뽑아서 해도 가능하긴 함

            b
Utah    -0.28
Ohio    -0.34
Texas   -0.15
Oregon  -1.09

In [206]:
import seaborn as sns

In [209]:
tips=sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [210]:
tips["tip"].max()

10.0

In [211]:
tips["tip"].min()

1.0

In [212]:
type(tips)

pandas.core.frame.DataFrame

In [221]:
def tip(x):
    return x.max(),x.min()
pd.DataFrame(tips["tip"]).apply(tip) # tips에서 tip열만 빼오면 siries가 되기때문에 데이터 프레임으로 변환후 apply

    tip
0  10.0
1   1.0

In [222]:
def tip(x):
    return x.max(),x.min()

tips[["tip"]].apply(tip)

    tip
0  10.0
1   1.0

In [223]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [224]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [225]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [226]:
frame.sort_index(axis="columns",ascending=False) # 내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [228]:
obj = pd.Series([4, 7, -3, 2])

In [230]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [233]:
obj.sort_values(ascending=False)  # ascending 옵션으로 오름,내림차순 설정가능 기본값=True,오름차순

1    7
0    4
3    2
2   -3
dtype: int64

In [234]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [237]:
obj.sort_values(ascending=True) # 정렬시 NaN이 맨 뒤로 감 오름차순 내림차순 상관없이.

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [238]:
obj.sort_values(na_position='first') #NaN위치는 na_position 옵션으로 설정 가능.

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [239]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [240]:
frame.sort_values('b') #데이터 프레임에서는 어느 열을 기준으로 할지 정해줘야함

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [243]:
frame.sort_values(['a','b']) #a열을 기준으로 정렬하되, 값이 같으면 b열을 비교해서 작은값을 위로

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [244]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [245]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [250]:
obj.rank(method="first") #공동이 없고 앞에있는데이터가 위에랭크

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [251]:
obj.rank(ascending=False) # ascending True면 데이터 낮은값이 1등 False면 반대

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [252]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [253]:
frame.rank() # frame.rank(axis=0)

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [256]:
frame.rank(axis=1,ascending=False) #axis=0 = index ,axis = 1 = columns

     b    a    c
0  1.0  2.0  3.0
1  1.0  3.0  2.0
2  3.0  2.0  1.0
3  1.0  2.0  3.0

In [257]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [258]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [259]:
obj.index.is_unique

False

In [261]:
obj['a'].is_unique

True

In [262]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.017628 -0.426664 -0.977470
a  0.708497 -0.481959  0.602089
b  0.590272 -0.166121  0.334064
b  0.767672 -1.706622 -0.044760
c -1.026560  0.311302  0.927646

In [265]:
df.loc['b']

          0         1         2
b  0.590272 -0.166121  0.334064
b  0.767672 -1.706622 -0.044760

In [266]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [267]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [268]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [269]:
df.sum(skipna=False) #skipna 옵션 = NaN값을 건너뛰고 계산한다. default값은 True False로하면 nan을 건너띄지않기때문에 결과가 NaN이 나옴

one   NaN
two   NaN
dtype: float64

In [270]:
df.mean() #axis=0,index 인덱스를 바꿔가면서 함수 적용

one    3.083333
two   -2.900000
dtype: float64

In [271]:
df.idxmax() # max값이 해당하는 index값을 추출해줌

one    b
two    d
dtype: object

In [273]:
df.idxmin()

one    d
two    b
dtype: object

In [274]:
df.cumsum()#누적 합 함수 Nan은 건너띄어짐

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [275]:
df.describe() #기술통계값 출력 4분위수등등이 출력

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [277]:
df.info() # 데이터 타입과 인덱스,columns등등 정보가 출력

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 268.0+ bytes

In [295]:
pd.read_csv("../../data/datasets/titanic/train.csv") # .. : 상위폴더로 이동  -> 상위 폴더로 두번 이동한후 data폴더로 이동

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [300]:
df=pd.read_csv("pew.csv")
df

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [298]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

In [299]:
df.describe()

,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
count,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000
mean,107.222222,154.500000,186.500000,183.444444,171.388889,288.055556,221.666667,177.611111,144.888889,340.055556
std,168.931784,255.172433,309.891869,291.470354,271.144446,458.442436,345.078849,275.679724,205.224952,530.523878
min,1.000000,2.000000,3.000000,4.000000,2.000000,7.000000,3.000000,4.000000,4.000000,8.000000
25%,12.250000,14.750000,17.000000,15.750000,15.000000,34.250000,25.250000,22.500000,23.750000,41.250000
50%,20.000000,27.000000,33.500000,40.000000,34.000000,66.500000,65.500000,48.500000,53.500000,74.500000
75%,170.000000,193.000000,192.000000,198.750000,166.750000,201.500000,128.750000,103.500000,134.250000,294.750000
max,575.000000,869.000000,1064.000000,982.000000,881.000000,1486.000000,949.000000,792.000000,634.000000,1529.000000

In [301]:
pd.read_csv("tesla_stock_quandl.csv") # 콤마로 sep되어있는 문서

,Date,Open,High,Low,Close,Volume,ExDividend,SplitRatio,AdjOpen,AdjHigh,AdjLow,AdjClose,AdjVolume
0,2018-03-27,304.00,304.2700,277.18,279.18,13696168.0,0.0,1.0,304.00,304.2700,277.18,279.18,13696168.0
1,2018-03-26,307.34,307.5900,291.36,304.18,8324639.0,0.0,1.0,307.34,307.5900,291.36,304.18,8324639.0
2,2018-03-23,311.25,311.6100,300.45,301.54,6600538.0,0.0,1.0,311.25,311.6100,300.45,301.54,6600538.0
3,2018-03-22,313.89,318.8200,308.18,309.10,4914307.0,0.0,1.0,313.89,318.8200,308.18,309.10,4914307.0
4,2018-03-21,310.25,322.4400,310.19,316.53,5927881.0,0.0,1.0,310.25,322.4400,310.19,316.53,5927881.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1944,2010-07-06,20.00,20.0000,15.83,16.11,6866900.0,0.0,1.0,20.00,20.0000,15.83,16.11,6866900.0
1945,2010-07-02,23.00,23.1000,18.71,19.20,5139800.0,0.0,1.0,23.00,23.1000,18.71,19.20,5139800.0
1946,2010-07-01,25.00,25.9200,20.27,21.96,8218800.0,0.0,1.0,25.00,25.9200,20.27,21.96,8218800.0
1947,2010-06-30,25.79,30.4192,23.30,23.83,17187100.0,0.0,1.0,25.79,30.4192,23.30,23.83,17187100.0
1948,2010-06-29,19.00,25.0000,17.54,23.89,18766300.0,0.0,1.0,19.00,25.0000,17.54,23.89,18766300.0

In [313]:
pd.read_table("gapminder.tsv") # 탭으로 sep 되어있는 문서 read_csv로 열면 parser(파싱:구문분석 파서: 구문분석기) 에러가 뜸

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [337]:
df=pd.read_csv("gapminder.tsv", sep="\t") # read_csv로 열려면 sep을 지정가능 \t 탭으로 지정해서 tsv파일을 열 수 있음 
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [338]:
df.head(5)
df.tail(5)
df.info() # DateFrame에서는 문자타입이 object로 나옴

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [339]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [340]:
df[df["country"]=="Zimbabwe"]

       country continent  year  lifeExp       pop   gdpPercap
1692  Zimbabwe    Africa  1952   48.451   3080907  406.884115
1693  Zimbabwe    Africa  1957   50.469   3646340  518.764268
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [341]:
df[df['continent']=='Asia'].shape[0]

396

In [342]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [344]:
df.iloc[0:12]

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [348]:
df.iloc[1:3]

       country continent  year  lifeExp       pop  gdpPercap
1  Afghanistan      Asia  1957   30.332   9240934  820.85303
2  Afghanistan      Asia  1962   31.997  10267083  853.10071

In [350]:
df.loc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [351]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [352]:
df[['year','pop']]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [354]:

df.iloc[:,[2,4]]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [361]:
df.loc[[0,99,999],'country':'year']

         country continent  year
0    Afghanistan      Asia  1952
99    Bangladesh      Asia  1967
999     Mongolia      Asia  1967

In [393]:


df.loc[df['continent']=="Asia"][['country','pop','gdpPercap']]

          country       pop    gdpPercap
0     Afghanistan   8425333   779.445314
1     Afghanistan   9240934   820.853030
2     Afghanistan  10267083   853.100710
3     Afghanistan  11537966   836.197138
4     Afghanistan  13079460   739.981106
...           ...       ...          ...
1675  Yemen, Rep.  11219340  1971.741538
1676  Yemen, Rep.  13367997  1879.496673
1677  Yemen, Rep.  15826497  2117.484526
1678  Yemen, Rep.  18701257  2234.820827
1679  Yemen, Rep.  22211743  2280.769906

[396 rows x 3 columns]

In [404]:
ds=df.iloc[:6,[1,5,4]]
# df.iloc[:,[1,2,4]]

In [413]:
ds.iloc[:3,0]

0    Asia
1    Asia
2    Asia
Name: continent, dtype: object

In [483]:
s=df.loc[:,['year','country','lifeExp']][(df['year']>2000)&(df['lifeExp']>50)&(df['continent']=="Africa")]
np.unique(s['year'])
#pd.unique(s)

array([2002, 2007], dtype=int64)

In [446]:
np.unique(df['continent'])

array(['Africa', 'Americas', 'Asia', 'Europe', 'Oceania'], dtype=object)

In [461]:
x=s.sort_values('lifeExp',ascending=0)
x

      year       country  lifeExp
1271  2007       Reunion   76.442
1270  2002       Reunion   75.744
911   2007         Libya   73.952
1571  2007       Tunisia   73.923
1570  2002       Tunisia   73.042
...    ...           ...      ...
514   2002      Ethiopia   50.725
275   2007          Chad   50.651
202   2002  Burkina Faso   50.650
274   2002          Chad   50.525
239   2007      Cameroon   50.430

[64 rows x 3 columns]

In [489]:
y=x[x['lifeExp'].rank(ascending=0)<6]

In [487]:
np.unique(df[df['year']>2000]['year'])

array([2002, 2007], dtype=int64)

In [502]:
y.reindex(['1등','2등','3등','4등','5등'])
y.index=['1등','2등','3등','4등','5등']

In [519]:
y.name="2000년 이후 기대수명 1등부터 5등 in Africa"

In [518]:
type(y)

pandas.core.frame.DataFrame